// only classes offered in Spring 2021

{	dept: “COMP”,
	code: 110,
	name: “Introduction to Programming”,
	description: “An introduction to programming. Fundamental programming skills, typically using Java or JavaScript. Problem analysis and algorithm design. Students may not receive credit for both COMP 110 and COMP 116. Students may not receive credit for this course after receiving credit for COMP 116 or higher. Honors version available”,
	prereq: [“COMP101”],
	req: [],
	hours: 3,
},{	dept: “COMP”,
	code: 116,
	name: “Introduction to Scientific Programming”,
	description: “An introduction to programming for computationally oriented scientists. Fundamental programming skills, typically using MATLAB or Python. Problem analysis and algorithm design with examples drawn from simple numerical and discrete problems. Students can receive credit for only one of COMP 110 and 116.”,
	prereq: [“COMP101”],
	req: [],
	hours: 3,
},{	dept: “COMP”,
	code: 126,
	name: “Practical Web Design and Development for Everyone”,
	description: “A ground-up introduction to current principles, standards, and best practice in website design, usability, accessibility, development, and management through project-based skills development in HTML5, CSS, and basic JavaScript. Intended for nonmajors.”,
	prereq: [],
	req: [],
	hours: 3,
},{	dept: “COMP”,
	code: 210,
	name: “Data Structures and Analysis”,
	description: “This course will teach you how to organize the data used in computer programs so that manipulation of that data can be done efficiently on large problems and large data instances. Rather than learning to use the data structures found in the libraries of programming languages, you will be learning how those libraries are constructed, and why the items that are included in them are there (and why some are excluded).”,
	prereq: [“COMP110”],
	req: [“COMP283”],
	hours: 3,
},{	dept: “COMP”,
	code: 211,
	name: “Systems Fundamentals”,
	description: “This is the first course in the introductory systems sequence. Students enter the course having taken an introductory programming course in a high-level programming language (COMP 110) and a course in discrete structures. The overarching goal is to bridge the gap between a students' knowledge of a high-level programming language (COMP 110) and computer organization (COMP 311).”,
	prereq: [“COMP210”,”COMP283”],
	req: [],
	hours: 3,
},